<?php

mb_internal_encoding('utf-8');

error_reporting(-1);

$word1 = array('Чудесных', 'Суровых', 'Занятных', 'Внезапных');
$word2 = array('слов', 'зим', 'глаз', 'дней', 'лет', 'мир', 'взор');
$word3 = array('прикосновений', 'поползновений', 'судьбы явлений',
 'сухие листья', 'морщины смерти', 'долины края', 'замены нету', 
'сухая юность', 'навек исчезнув');
$word4 = array('обретаю', 'понимаю', 'начертаю', 'закрываю', 'оставляю',
 'вынимаю', 'умираю', 'замерзаю', 'выделяю');
$word5 = array('очертания', 'безысходность', 'начертанья', 'смысл жизни',
 'вирус смерти', 'радость мира');

$words = array(1 => $word1, $word2, $word3, $word4, $word5);

$poetry = '';
    
for ($x = 1; $x <= 2; $x++){
    for($y = 1; $y <= 3; $y++){
        $poetry = $poetry.' '.$words[$y][array_rand($words[$y])];
    }
    $poetry = $poetry."<br>";
}

    $poetry = $poetry.' Я';


for($y = 4; $y <= 5; $y++){
    $poetry = $poetry.' '.$words[$y][array_rand($words[$y])];
}


echo "<p>$poetry</p>";

